[
  {
    "company": "Morgan Stanley",
    "dates": "July 2017 - Present",
    "title": "UI Engineer, VP Prime Brokerage",
    "description": "Developing web and mobile based applications for the Matrix platform with Angular, ngrx, and Ionic."
  },
  {
    "company": "The Things Network New York",
    "dates": "July 2017 - Present",
    "title": "Member of Board of Directors",
    "description": "Facilitating the deployment of The Things Network (TTN), a free and open source Internet of Things data network owned and operated by its users in the five boroughs of New York City. Promote and support other TTN communities throughout the United States."
  },
  {
    "company": "Open Focus",
    "dates": "June 2016 - Present",
    "title": "Member of Board of Directors",
    "description": "Open Focus is a humanitarian organization committed to empowering communities through the use of open-source technology solutions. We operate online and offline in order to promote and foster collaboration from the grassroots to global levels. We believe in transparency, open-source technology, and open communication. Our flagship initiative, High Tech Humanitarians (HTH), is an open-source, online repository and digital laboratory for communities, innovators, and organizations to work together for humanitarian solutions to the world’s greatest challenges."
  },
  {
    "company": "IPsoft",
    "dates": "January 2017 - June 2017",
    "title": "Senior UI Engineer",
    "description": "Leading a team of 6 to support 30+ custom client UI deployments of the Amelia AI customer support platform. Developing and designing ReactJS applications. Utilizing Git and NPM for version control and component reuse. Managing devOps through continuous integration with Bamboo and Bash scripting."
  },
  {
    "company": "EffectiveUI",
    "dates": "April 2015 – December 2016",
    "title": "Front End Senior UI Engineer",
    "description": "Creating web apps, rapid prototypes, and style guides. ReactJS, Webpack, Flux, Redux, etc."
  },
  {
    "company": "Swingset Imagination",
    "dates": "September 2010 – 2016",
    "title": "Front End Web Developer / Partner",
    "description": "Leading a team of 6 to support 30+ custom client UI deployments of the Amelia AI customer support platform. Developing and designing ReactJS applications. Utilizing Git and NPM for version control and component reuse. Managing devOps through continuous integration with Bamboo and Bash scripting."
  },
  {
    "company": "Percolate",
    "dates": "July 2014 – November 2014",
    "title": "Front End Engineer",
    "description": "Front end application development utilizing a highly customized Backbone.js framework."
  },
  {
    "company": "Modus Create",
    "dates": "February 2014 – July 2014",
    "title": "User Experience (UX) Developer",
    "description": "Application development utilizing frameworks such as Sencha Touch, ExtJS, AngularJS, and good old plain JS. Styling where needed."
  },
  {
    "company": "Sungard – Morgan Stanley",
    "dates": "November 2012 – February 2014",
    "title": "User Experience (UX) Developer",
    "description": "Worked on-site at the Morgan Stanley offices with the UX team. Duties included ExtJS, Sencha Touch and Highcharts theme customization, rapid prototyping, and Sencha Touch mobile application development with a focus on user experience. Technology utilized includes SASS, Compass, Unix CLI, NodeJS, Wintersmith, jQuery, Bootstrap, etc."
  },
  {
    "company": "NYSE Euronext",
    "dates": "February 2011 – May 2012",
    "title": "Front End Web Developer",
    "description": "XHTML, CSS, jQuery, and PHP for Drupal themes. Developed parent and children theme for custom Drupal module infrastructure."
  },
  {
    "company": "Freelance",
    "dates": "2003 – Present",
    "title": "Web Design and Development",
    "description": "Site planning, design, and development focusing on accessible cross-browser code compatible with mobile devices. Utilizing custom WordPress themes or Drupal configurations in order to allow site owners to best manage and control their content according to their needs."
  },
  {
    "company": "Visual Goodness",
    "dates": "November 2010 – February 2011",
    "title": "Front End Web Developer",
    "description": "XHTML, CSS, and Javascript development for women.nfl.com (now defunct)."
  },
  {
    "company": "University of Texas System, Austin, Texas",
    "dates": "2009 – 2010",
    "title": "Web Developer",
    "description": "User oriented site planning, information architecture, interaction design and front-end web development. Planning and execution of website refresh from static HTML pages managed through Dreamweaver to a Drupal based content management system."
  },
  {
    "company": "University of Texas System, Austin, Texas",
    "dates": "2008 – 2009",
    "title": "Web Designer",
    "description": "Front-end development with XHTML and CSS, interface design and development with jQuery, social media promotion direction (Facebook, YouTube, and vimeo), author blog entries for stateoftomorrow.com."
  },
  {
    "company": "itzbig.com, Austin, Texas",
    "dates": "January 2007 – June 2007",
    "title": "Web Producer",
    "description": "Agile product design and development approach focusing on user-experience, front-end development of marketing website, creation of a product documentation wiki, production of interaction diagrams, client support."
  },
  {
    "company": "Mesh.net, Fort Worth, Texas",
    "dates": "2000 – 2003",
    "title": "Senior Web Developer",
    "description": "Directed and supervised the development and design of websites, updated and maintained websites, oversaw UI and graphic design, and designed and implemented search engine optimization strategies."
  }
]
